# Pythons
brew 'python'
brew 'python3'
brew 'pypy'
brew 'pypy3'
# the fish shell
brew 'fish'
# this which will allow us to copy from within tmux / tmate
# Without this, tmate will crash given our settings
brew 'reattach-to-user-namespace'
# Allow the terminal to be shared
brew 'tmate'
# text editor
brew 'neovim'
# Required for CtrlSF for Neovim
brew 'ack'
# Required for Tagbar in Neovim
brew 'ctags'
# A nice way to download things
brew 'wget'
# Package manager for Node.js
brew 'npm'
# CLI for GitHub
brew 'hub'
tap 'homebrew/cask'
cask 'firefox'
cask 'google-chrome'
cask 'mactex'
cask 'virtualbox'
cask 'alfred'
cask 'steam'
cask 'vlc'
cask 'transmission'
cask 'spotify'
