# Pythons
brew 'python3'
brew 'pypy'
brew 'pypy3'
# the fish shell
brew 'fish'
# this which will allow us to copy from within tmux / tmate
# Without this, tmate will crash given our settings
brew 'reattach-to-user-namespace'
# Allow the terminal to be shared
brew 'tmate'
# text editor
brew 'neovim'
# Required for CtrlSF for Neovim
brew 'ack'
# Required to compile YCM
brew 'cmake'
# Required for Tagbar in Neovim
brew 'ctags'
# A nice way to download things
brew 'wget'
# Package manager for Node.js
brew 'npm'
# CLIs for GitHub
brew 'hub'
brew 'gh'
brew 'fzf'
brew 'rg'
brew 'cloc'
brew 'shellcheck'
brew 'enchant'

tap 'homebrew/cask'
cask 'firefox'
cask 'google-chrome'
cask 'mactex'
cask 'alfred'
cask 'steam'
cask 'vlc'
cask 'transmission'
cask 'spotify'
cask 'vagrant'
cask 'textmate'
cask 'docker'
cask '1password'
cask 'shimo'
cask 'zoomus'
cask 'signal'
cask 'transmit'
cask 'google-backup-and-sync'
cask 'cd-to'
cask 'soulver'
cask 'coderunner'
cask 'plex'
cask 'plexamp'

# Install mac app store apps
brew 'mas'
mas "Things3", id: 904280696
mas "Mactracker", id: 430255202
mas "Speedtest", id: 1153157709
mas "Calcbot", id: 931657367
mas "Kaleidoscope", id: 587512244
mas "Reeder 5", id: 1529448980
mas "Xcode", id: 497799835
mas "WhatsApp", id: 1147396723
mas "Tweetbot", id: 1384080005
mas "Deliveries", id: 924726344
mas "Clear", id: 504544917
mas "Textual", id: 403012667
mas "Telegram Desktop", id: 946399090
mas "Paprika Recipe Manager 3", id: 1303222628
mas "PopClip", id: 445189367
mas "Name Mangler 3", id: 603637384
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "SofaPlay", id: 566429668
mas "Downcast", id: 668429425
mas "StopTheMadness", id: 1376402589
mas "Postico", id: 1031280567
mas "DaisyDisk", id: 411643860
mas "Gemini 2", id: 1090488118
mas "Evernote", id: 406056744
mas "iMovie", id: 408981434
mas "Numbers", id: 409203825
mas "Quiver", id: 866773894
mas "Skitch", id: 425955336
mas "iA Writer", id: 775737590
mas "Keynote", id: 409183694
mas "Shazam", id: 897118787
mas "1Blocker", id: 1107421413
mas "Facebook Messenger", id: 1480068668
mas "Glance", id: 1513574319
mas "InView", id: 1508508401
mas "Pasteboard Viewer", id: 1499215709
mas "OwlOCR", id: 1499181666
