# Pythons
brew 'python3'
brew 'pypy'
brew 'pypy3'
# the fish shell
brew 'fish'
# this which will allow us to copy from within tmux / tmate
# Without this, tmate will crash given our settings
brew 'reattach-to-user-namespace'
# Allow the terminal to be shared
brew 'tmate'
# text editor
brew 'neovim'
# Required for CtrlSF for Neovim
brew 'ack'
# Required to compile YCM
brew 'cmake'
# Required for Tagbar in Neovim
brew 'ctags'
# A nice way to download things
brew 'wget'
# Package manager for Node.js
brew 'npm'
# CLIs for GitHub
brew 'hub'
brew 'gh'
brew 'gpg'
brew 'fzf'
brew 'tree'
brew 'ag'
brew 'rg'
brew 'cloc'
brew 'shellcheck'
brew 'enchant'
brew 'rbenv'
# Node 16 is needed for Copilot for nvim
brew 'node@16'
# 1Password CLI is needed for 1Password Alfred integration
brew '1password-cli'
brew 'pipx'
brew 'pyenv'
brew 'uv'
brew 'git-lfs'

cask 'firefox'
cask 'google-chrome'
cask 'mactex'
cask 'alfred'
cask 'steam'
cask 'vlc'
cask 'transmission'
cask 'spotify'
cask 'vagrant'
cask 'textmate'
cask 'docker'
cask '1password'
cask 'shimo'
cask 'zoom'
cask 'signal'
cask 'transmit'
cask 'cd-to'
cask 'soulver'
cask 'coderunner'
cask 'plex'
cask 'plexamp'
cask 'visual-studio-code'

# Install mac app store apps
brew 'mas'
mas "Things3", id: 904280696
mas "Mactracker", id: 430255202
mas "Speedtest", id: 1153157709
mas "Reeder 5", id: 1529448980
mas "Xcode", id: 497799835
mas "WhatsApp", id: 1147396723
mas "Deliveries", id: 924726344
mas "Clear", id: 504544917
mas "Telegram Desktop", id: 946399090
mas "Paprika Recipe Manager 3", id: 1303222628
mas "PopClip", id: 445189367
mas "Name Mangler 3", id: 603637384
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "SofaPlay", id: 566429668
mas "StopTheMadness Pro", id: 6471380298
mas "Postico", id: 1031280567
mas "DaisyDisk", id: 411643860
mas "Gemini 2", id: 1090488118
mas "iMovie", id: 408981434
mas "Numbers", id: 409203825
mas "Quiver", id: 866773894
mas "Skitch", id: 425955336
mas "iA Writer", id: 775737590
mas "Keynote", id: 409183694
mas "Shazam", id: 897118787
mas "1Blocker", id: 1365531024
mas "Facebook Messenger", id: 1480068668
mas "Glance", id: 1564688210
mas "InView", id: 1508508401
mas "OwlOCR", id: 6462355119
mas "PoolsideFM", id: 1514817810
mas "LG Screen Manager", id: 1142051783
mas "Deliveries", id: 290986013
mas "OwlOCR", id: 1499181666
mas "HP", id: 1474276998
mas "Craft", id: 1487937127
mas "Soulver", id: 1508732804
mas "1Password for Safari", id: 1569813296
mas "Clockify", id: 1364502317
mas "Paprika", id: 451907568
mas "Overcast", id: 888422857
